from random import *

#r1 = randint(1, 3)
#r2 = randint(1, 3)

#вариант где игрок выбирает
print("1 - Камень, 2 - бумага, 3 - ножницы")

r1 = input("Вариант: ")
r2 = randint(1, 3)


if r1 == 1:
   a1 = "камень"
elif r1 == 2:
    a1 = "бумага"
else:
    a1 = "ножницы"

if r2 == 1:
    a2 = "камень"
elif r2 == 2:
    a2 = "бумага"
else:
    a2 = "ножницы"

print("Первый ответ:", a1)
#print("Твой ответ:", a1)
print("Второй ответ:", a2)

if (a1 == "бумага" and a2 == "камень") or \
   (a1 == "камень" and a2 == "ножницы") or \
   (a1 == "ножницы" and a2 == "бумага"):
    print("Первый побеждает!")
    #print("Ты победил!")
elif (a2 == "бумага" and a1 == "камень") or \
     (a2 == "камень" and a1 == "ножницы") or \
     (a2 == "ножницы" and a1 == "бумага"):
    print("Второй побеждает!")
else:
    print("Ничья!")
